================================================================================
Empty
================================================================================

--------------------------------------------------------------------------------

(circuit)

================================================================================
Comment
================================================================================

# empty circuit

--------------------------------------------------------------------------------

(circuit (comment))


================================================================================
Two-qubit gate
================================================================================

H 0 1

--------------------------------------------------------------------------------

(circuit
    (instruction
        (name)
        (qubit_target)
        (qubit_target)
        ))


================================================================================
Several gates
================================================================================

H 0
X 1
Y 2
Z 3

--------------------------------------------------------------------------------

(circuit
    (instruction (name) (qubit_target))
    (instruction (name) (qubit_target))
    (instruction (name) (qubit_target))
    (instruction (name) (qubit_target)))

================================================================================
Instruction with arguments
================================================================================

PAULI_CHANNEL_1(1, 2., 0.3) 0 1

--------------------------------------------------------------------------------

(circuit
    (instruction
        (name)
        (argument_list
            (arg)
            (arg)
            (arg)
            )
        (qubit_target)
        (qubit_target)
    ))

================================================================================
Repeat block
================================================================================

REPEAT 10 {
    CX 0 1
    CX 1 0
}

--------------------------------------------------------------------------------

(circuit
    (repeat_block
        (repeat_value)
        (repeat_body
            (instruction (name) (qubit_target) (qubit_target))
            (instruction (name) (qubit_target) (qubit_target))
        )
    )
)

================================================================================
Nested repeat blocks
================================================================================

REPEAT 10 {
    REPEAT 10 {
        H 1
    }
}

--------------------------------------------------------------------------------

(circuit
    (repeat_block
        (repeat_value)
        (repeat_body
            (repeat_block
                (repeat_value)
                (repeat_body
                    (instruction (name) (qubit_target))
                )))))
